package ru.thelensky.utils;

public class PrinterNumber {
    public static char[][] ZERO = {
            { ' ', '*', '*', ' ', },
            { '*', ' ', ' ', '*', },
            { '*', ' ', ' ', '*', },
            { '*', ' ', ' ', '*', },
            { ' ', '*', '*', ' ', }
    };
    public static char[][] ONE = {
            { ' ', ' ', '*', ' ', },
            { ' ', '*', '*', ' ', },
            { ' ', ' ', '*', ' ', },
            { ' ', ' ', '*', ' ', },
            { '*', '*', '*', '*', }
    };
    public static char[][] TWO = {
            { '*', '*', '*', '*', },
            { ' ', ' ', ' ', '*', },
            { '*', '*', '*', '*', },
            { '*', ' ', ' ', ' ', },
            { '*', '*', '*', '*', }
    };
    public static char[][] THREE = {
            { '*', '*', '*', '*', },
            { ' ', ' ', '*', ' ', },
            { ' ', '*', '*', ' ', },
            { ' ', ' ', ' ', '*', },
            { '*', '*', '*', ' ', }
    };
    public static char[][] FORE = {
            { '*', ' ', ' ', '*', },
            { '*', ' ', ' ', '*', },
            { '*', '*', '*', '*', },
            { ' ', ' ', ' ', '*', },
            { ' ', ' ', ' ', '*', }
    };
    public static char[][] FIFE = {
            { '*', '*', '*', '*', },
            { '*', ' ', ' ', ' ', },
            { '*', '*', '*', '*', },
            { ' ', ' ', ' ', '*', },
            { '*', '*', '*', '*', }
    };
    public static char[][] SIX = {
            { ' ', '*', '*', '*', },
            { '*', ' ', ' ', ' ', },
            { '*', '*', '*', ' ', },
            { '*', ' ', ' ', '*', },
            { ' ', '*', '*', ' ', }
    };
    public static char[][] SEVEN = {
            { '*', '*', '*', '*', },
            { ' ', ' ', '*', ' ', },
            { ' ', '*', ' ', ' ', },
            { ' ', '*', ' ', ' ', },
            { ' ', '*', ' ', ' ', }
    };
    public static char[][] EIGHT = {
            { ' ', '*', '*', ' ', },
            { '*', ' ', ' ', '*', },
            { ' ', '*', '*', ' ', },
            { '*', ' ', ' ', '*', },
            { ' ', '*', '*', ' ', }
    };
    public static char[][] NINE = { { ' ', '*', '*', ' ', }, { '*', ' ', ' ', '*', }, { ' ', '*', '*', '*', },
            { ' ', ' ', ' ', '*', }, { '*', '*', '*', ' ', } };

            
    public static char[][][] NUMBERS = { ZERO, ONE, TWO, THREE, FORE, FIFE, SIX, SEVEN, EIGHT, NINE };


    public void printNumber(char[][] number) {
        int lengthOuter = 5; // длинна внешнего массива. Так делать не надо. Заменить на number.length
        
        for (int i = 0; i < lengthOuter; i++) {
            for (int j = 0; j < number[i].length; j++) { //number[i].length; // длинна внешнего ма
                //выбрать из массива массивов массив по индексу i, а затем из выбранного массива выбрать элемент по индексу j 
                System.out.print(number[i][j]); 
                
                // эквивалентно строке выше
                // char [] outer = number[i];
                // char ch = outer[j];
                // System.out.print(ch);
            }

            // \n - символ перевода "с новой строки"
            System.out.print("\n");
            
            // эквивалентно строке выше 
            // System.out.println();
        }
    }
}
